# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.rand(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [3]:
df

          W         X         Y         Z
A  0.714483  0.922587  0.365347  0.227867
B  0.960520  0.312265  0.495569  0.670187
C  0.985157  0.746675  0.115139  0.857933
D  0.546959  0.597683  0.048904  0.460198
E  0.166542  0.653156  0.286164  0.294221

In [4]:
df.to_excel('Mohit.xlsx',sheet_name='Sheet1')

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [5]:
df['W']

A    0.714483
B    0.960520
C    0.985157
D    0.546959
E    0.166542
Name: W, dtype: float64

In [6]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  0.714483  0.227867
B  0.960520  0.670187
C  0.985157  0.857933
D  0.546959  0.460198
E  0.166542  0.294221

DataFrame Columns are just Series

In [8]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [9]:
df['new'] = df['W'] + df['Y']

In [10]:
df

          W         X         Y         Z       new
A  0.714483  0.922587  0.365347  0.227867  1.079830
B  0.960520  0.312265  0.495569  0.670187  1.456089
C  0.985157  0.746675  0.115139  0.857933  1.100296
D  0.546959  0.597683  0.048904  0.460198  0.595862
E  0.166542  0.653156  0.286164  0.294221  0.452706

** Removing Columns**

In [11]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.714483  0.922587  0.365347  0.227867
B  0.960520  0.312265  0.495569  0.670187
C  0.985157  0.746675  0.115139  0.857933
D  0.546959  0.597683  0.048904  0.460198
E  0.166542  0.653156  0.286164  0.294221

In [12]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.714483  0.922587  0.365347  0.227867  1.079830
B  0.960520  0.312265  0.495569  0.670187  1.456089
C  0.985157  0.746675  0.115139  0.857933  1.100296
D  0.546959  0.597683  0.048904  0.460198  0.595862
E  0.166542  0.653156  0.286164  0.294221  0.452706

In [13]:
df.drop('new',axis=1,inplace=True)

In [14]:
df

          W         X         Y         Z
A  0.714483  0.922587  0.365347  0.227867
B  0.960520  0.312265  0.495569  0.670187
C  0.985157  0.746675  0.115139  0.857933
D  0.546959  0.597683  0.048904  0.460198
E  0.166542  0.653156  0.286164  0.294221

Can also drop rows this way:

In [15]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.714483  0.922587  0.365347  0.227867
B  0.960520  0.312265  0.495569  0.670187
C  0.985157  0.746675  0.115139  0.857933
D  0.546959  0.597683  0.048904  0.460198

** Selecting Rows**

In [16]:
df.loc['A']

W    0.714483
X    0.922587
Y    0.365347
Z    0.227867
Name: A, dtype: float64

Or select based off of position instead of label

In [17]:
df.iloc[2]

W    0.985157
X    0.746675
Y    0.115139
Z    0.857933
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [18]:
df.loc['B','Y']

0.49556892288125054

In [19]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.714483  0.365347
B  0.960520  0.495569

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [20]:
df

          W         X         Y         Z
A  0.714483  0.922587  0.365347  0.227867
B  0.960520  0.312265  0.495569  0.670187
C  0.985157  0.746675  0.115139  0.857933
D  0.546959  0.597683  0.048904  0.460198
E  0.166542  0.653156  0.286164  0.294221

In [21]:
df>0

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [22]:
df[df>0]

          W         X         Y         Z
A  0.714483  0.922587  0.365347  0.227867
B  0.960520  0.312265  0.495569  0.670187
C  0.985157  0.746675  0.115139  0.857933
D  0.546959  0.597683  0.048904  0.460198
E  0.166542  0.653156  0.286164  0.294221

In [23]:
df[df['W']>0]

          W         X         Y         Z
A  0.714483  0.922587  0.365347  0.227867
B  0.960520  0.312265  0.495569  0.670187
C  0.985157  0.746675  0.115139  0.857933
D  0.546959  0.597683  0.048904  0.460198
E  0.166542  0.653156  0.286164  0.294221

In [24]:
df[df['W']>0]['Y']

A    0.365347
B    0.495569
C    0.115139
D    0.048904
E    0.286164
Name: Y, dtype: float64

In [25]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.365347  0.922587
B  0.495569  0.312265
C  0.115139  0.746675
D  0.048904  0.597683
E  0.286164  0.653156

For two conditions you can use | and & with parenthesis:

In [28]:
df[(df['W']>0) & (df['Y'] > 0.1)]

          W         X         Y         Z
A  0.714483  0.922587  0.365347  0.227867
B  0.960520  0.312265  0.495569  0.670187
C  0.985157  0.746675  0.115139  0.857933
E  0.166542  0.653156  0.286164  0.294221

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [29]:
df

          W         X         Y         Z
A  0.714483  0.922587  0.365347  0.227867
B  0.960520  0.312265  0.495569  0.670187
C  0.985157  0.746675  0.115139  0.857933
D  0.546959  0.597683  0.048904  0.460198
E  0.166542  0.653156  0.286164  0.294221

In [30]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.714483  0.922587  0.365347  0.227867
1     B  0.960520  0.312265  0.495569  0.670187
2     C  0.985157  0.746675  0.115139  0.857933
3     D  0.546959  0.597683  0.048904  0.460198
4     E  0.166542  0.653156  0.286164  0.294221

In [31]:
newind = 'CA NY WY OR CO'.split()

In [32]:
df['States'] = newind

In [33]:
df

          W         X         Y         Z States
A  0.714483  0.922587  0.365347  0.227867     CA
B  0.960520  0.312265  0.495569  0.670187     NY
C  0.985157  0.746675  0.115139  0.857933     WY
D  0.546959  0.597683  0.048904  0.460198     OR
E  0.166542  0.653156  0.286164  0.294221     CO

In [34]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.714483  0.922587  0.365347  0.227867
NY      0.960520  0.312265  0.495569  0.670187
WY      0.985157  0.746675  0.115139  0.857933
OR      0.546959  0.597683  0.048904  0.460198
CO      0.166542  0.653156  0.286164  0.294221

In [35]:
df

          W         X         Y         Z States
A  0.714483  0.922587  0.365347  0.227867     CA
B  0.960520  0.312265  0.495569  0.670187     NY
C  0.985157  0.746675  0.115139  0.857933     WY
D  0.546959  0.597683  0.048904  0.460198     OR
E  0.166542  0.653156  0.286164  0.294221     CO

In [36]:
df.set_index('States',inplace=True)

In [37]:
df

               W         X         Y         Z
States
CA      0.714483  0.922587  0.365347  0.227867
NY      0.960520  0.312265  0.495569  0.670187
WY      0.985157  0.746675  0.115139  0.857933
OR      0.546959  0.597683  0.048904  0.460198
CO      0.166542  0.653156  0.286164  0.294221

In [38]:
df.reset_index()

  States         W         X         Y         Z
0     CA  0.714483  0.922587  0.365347  0.227867
1     NY  0.960520  0.312265  0.495569  0.670187
2     WY  0.985157  0.746675  0.115139  0.857933
3     OR  0.546959  0.597683  0.048904  0.460198
4     CO  0.166542  0.653156  0.286164  0.294221

# Great Job!